[
    {
        "id": 640636,
        "title": "Creamy Egg Marinara Breakfast Dip",
        "readyInMinutes": 90,
        "servings": 4,
        "image": "https://spoonacular.com/recipeImages/640636-300x150.jpg",
        "imageUrls": [
            "Creamy-Egg-Marinara-Breakfast-Dip-640636.jpg"
        ],
        "description": "Creamy Egg Marinara Breakfast Dip takes approximately <b>1 hour and 30 minutes</b> from beginning to end. This recipe makes 4 servings with <b>639 calories</b>, <b>22g of protein</b>, and <b>40g of fat</b> each. For <b>$2.21 per serving</b>, this recipe <b>covers 29%</b> of your daily requirements of vitamins and minerals. It works well as a breakfast. Not a lot of people made this recipe, and 1 would say it hit the spot. <b>The Super Bowl</b> will be even more special with this recipe. A mixture of canned tomatoes, baguette, parmesan cheese, and a handful of other ingredients are all it takes to make this recipe so tasty. It is brought to you by Foodista. With a spoonacular <b>score of 54%</b>, this dish is solid. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/creamy-grilled-egg-and-cheese-breakfast-sandwiches-1076366\">Creamy Grilled Egg and Cheese Breakfast Sandwiches</a>, <a href=\"https://spoonacular.com/recipes/southwest-egg-rolls-with-creamy-avocado-dip-505700\">Southwest Egg Rolls with Creamy Avocado Dip</a>, and <a href=\"https://spoonacular.com/recipes/avocado-egg-rolls-with-creamy-cilantro-ranch-dip-565625\">Avocado Egg Rolls with Creamy Cilantro Ranch Dip</a>."
    },
    {
        "id": 632768,
        "title": "Artichoke Pesto Pasta",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https://spoonacular.com/recipeImages/632768-300x150.jpg",
        "imageUrls": [
            "Artichoke-Pesto-Pasta-632768.jpg"
        ],
        "description": "You can never have too many main course recipes, so give Artichoke Pesto Pastan a try. One portion of this dish contains around <b>21g of protein</b>, <b>20g of fat</b>, and a total of <b>446 calories</b>. For <b>$1.71 per serving</b>, this recipe <b>covers 18%</b> of your daily requirements of vitamins and minerals. This recipe serves 4. This recipe from Foodista has 1 fans. A mixture of basil, garlic, parmesan, and a handful of other ingredients are all it takes to make this recipe so delicious. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. With a spoonacular <b>score of 60%</b>, this dish is good. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/pasta-with-artichoke-pesto-109016\">Pasta with Artichoke Pesto</a>, <a href=\"https://spoonacular.com/recipes/artichoke-pesto-pasta-109196\">Artichoke Pesto Pasta</a>, and <a href=\"https://spoonacular.com/recipes/artichoke-pesto-pasta-salad-158467\">Artichoke Pesto Pasta Salad</a>."
    },
    {
        "id": 57810,
        "title": "Choucroute Garni",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https://spoonacular.com/recipeImages/57810-300x150.jpg",
        "imageUrls": [
            "choucroute_garni-57810.jpg",
            "choucroute-garni-2-57810.jpg"
        ],
        "description": "You can never have too many main course recipes, so give Choucroute Garni a try. Watching your figure? This gluten free and dairy free recipe has <b>915 calories</b>, <b>54g of protein</b>, and <b>48g of fat</b> per serving. For <b>$5.26 per serving</b>, this recipe <b>covers 49%</b> of your daily requirements of vitamins and minerals. This recipe serves 4. This recipe from Foodista requires onion, bacon drippings, wine, and sausage. From preparation to the plate, this recipe takes about <b>45 minutes</b>. 1 person were impressed by this recipe. Overall, this recipe earns a <b>pretty good spoonacular score of 70%</b>. <a href=\"https://spoonacular.com/recipes/choucroute-garni-130222\">Choucroute Garni</a>, <a href=\"https://spoonacular.com/recipes/choucroute-garni-57771\">Choucroute Garni</a>, and <a href=\"https://spoonacular.com/recipes/choucroute-garni-57758\">Choucroute Garni</a> are very similar to this recipe."
    }
]