[
    {
        "id": 639456,
        "title": "Cinnamon Eggless Coffee Cake",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https://spoonacular.com/recipeImages/639456-300x150.jpg",
        "imageUrls": [
            "Cinnamon-Eggless-Coffee-Cake-639456.jpg"
        ],
        "description": "Forget going out to eat or ordering takeout every time you crave Southern food. Try making Cinnamon Eggless Coffee Cake at home. This lacto ovo vegetarian recipe serves 6 and costs <b>58 cents per serving</b>. One portion of this dish contains around <b>5g of protein</b>, <b>18g of fat</b>, and a total of <b>375 calories</b>. Head to the store and pick up vanillan essence, flour, cinnamon powder, and a few other things to make it today. It works well as an inexpensive breakfast. It is brought to you by Foodista. 6 people were glad they tried this recipe. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. Overall, this recipe earns a <b>not so tremendous spoonacular score of 15%</b>. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/eggless-dates-walnut-coffee-cake-eggless-cake-s-486685\">eggless dates walnut coffee cake | eggless cake s</a>, <a href=\"https://spoonacular.com/recipes/eggless-apple-cinnamon-muffin-eggless-muffins-622027\">Eggless Apple Cinnamon Muffin | Eggless muffins</a>, and <a href=\"https://spoonacular.com/recipes/mug-cinnamon-coffee-cake-with-coffee-mate-extra-sweet-creamy-562548\">Mug Cinnamon Coffee Cake with Coffee-mate Extra Sweet & Creamy</a>."
    },
    {
        "id": 659834,
        "title": "Sheesh Kabobs with Yogurt Dip",
        "readyInMinutes": 45,
        "servings": 3,
        "image": "https://spoonacular.com/recipeImages/659834-300x150.jpg",
        "imageUrls": [
            "Sheesh-Kabobs-with-Yogurt-Dip-659834.jpg"
        ],
        "description": "If you want to add more <b>gluten free</b> recipes to your repertoire, Sheesh Kabobs with Yogurt Dip might be a recipe you should try. This main course has <b>831 calories</b>, <b>32g of protein</b>, and <b>72g of fat</b> per serving. For <b>$3.27 per serving</b>, this recipe <b>covers 32%</b> of your daily requirements of vitamins and minerals. This recipe serves 3. If you have sour cream, salt, cumin powder, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. 1 person were impressed by this recipe. <b>The Super Bowl</b> will be even more special with this recipe. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Overall, this recipe earns a <b>pretty good spoonacular score of 70%</b>. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/breakfast-kabobs-with-yogurt-dip-168225\">Breakfast Kabobs with Yogurt Dip</a>, <a href=\"https://spoonacular.com/recipes/double-chocolate-muffins-againsheesh-258825\">Double Chocolate Muffins (Again…Sheesh!)</a>, and <a href=\"https://spoonacular.com/recipes/veggie-kabobs-with-gingered-yogurt-409011\">Veggie Kabobs with Gingered Yogurt</a>."
    },
    {
        "id": 649850,
        "title": "Lemon-Pepper Fettucine Alfredo",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https://spoonacular.com/recipeImages/649850-300x150.jpg",
        "imageUrls": [
            "Lemon-Pepper-Fettucine-Alfredo-649850.jpg"
        ],
        "description": "Lemon-Pepper Fettucine Alfredo might be just the <b>Mediterranean</b> recipe you are searching for. This recipe serves 4 and costs $4.56 per serving. This main course has <b>794 calories</b>, <b>22g of protein</b>, and <b>55g of fat</b> per serving. 1 person were impressed by this recipe. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. This recipe from Foodista requires lemon pepper, butter, pecorino romano cheese, and lemon zest. It is a good option if you're following a <b>gluten free and lacto ovo vegetarian</b> diet. Taking all factors into account, this recipe <b>earns a spoonacular score of 74%</b>, which is solid. Similar recipes include <a href=\"https://spoonacular.com/recipes/fettucine-alfredo-139032\">Fettucine Alfredo</a>, <a href=\"https://spoonacular.com/recipes/fettucine-seafood-alfredo-393127\">Fettucine Seafood Alfredo</a>, and <a href=\"https://spoonacular.com/recipes/jalapeno-popper-fettucine-alfredo-631380\">Jalapeno Popper Fettucine Alfredo</a>."
    }
]