[
    {
        "id": 634006,
        "title": "Banana Bread",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https://spoonacular.com/recipeImages/634006-312x150.jpg",
        "imageUrls": [
            "Banana-Bread-634006.jpg"
        ],
        "description": "You can never have too many breakfast recipes, so give Banana Bread a try. This recipe serves 6 and costs 58 cents per serving. One portion of this dish contains approximately <b>5g of protein</b>, <b>32g of fat</b>, and a total of <b>579 calories</b>. It is a good option if you're following a <b>lacto ovo vegetarian</b> diet. 3 people have made this recipe and would make it again. It is brought to you by Foodista. A mixture of baking soda, vanilla, sugar, and a handful of other ingredients are all it takes to make this recipe so scrumptious. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Overall, this recipe earns a <b>not so awesome spoonacular score of 18%</b>. Similar recipes include <a href=\"https://spoonacular.com/recipes/banana-bread-how-to-make-banana-bread-quick-banana-bread-488649\">banana bread , how to make banana bread | quick banana bread</a>, <a href=\"https://spoonacular.com/recipes/eggless-banana-bread-how-to-make-vegan-banana-bread-486641\">eggless banana bread , how to make vegan banana bread</a>, and <a href=\"https://spoonacular.com/recipes/banana-bread-you-can-make-banana-bread-at-home-it-is-easy-to-make-and-tastes-wonderful-601338\">Banana Bread – you can make banana bread at home, it is easy to make, and tastes wonderful</a>."
    },
    {
        "id": 637592,
        "title": "Cheese Tortellini With Sausage Ragu",
        "readyInMinutes": 45,
        "servings": 6,
        "image": "https://spoonacular.com/recipeImages/637592-312x150.jpg",
        "imageUrls": [
            "Cheese-Tortellini-With-Sausage-Ragu-637592.jpg"
        ],
        "description": "Cheese Tortellini With Sausage Ragu is a main course that serves 6. One portion of this dish contains around <b>27g of protein</b>, <b>27g of fat</b>, and a total of <b>608 calories</b>. For <b>$1.56 per serving</b>, this recipe <b>covers 18%</b> of your daily requirements of vitamins and minerals. This recipe from Foodista requires oregano, fresh basil leaves, ground sausage, and red wine. 1 person found this recipe to be delicious and satisfying. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. With a spoonacular <b>score of 44%</b>, this dish is solid. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/cheese-tortellini-with-sausage-tomatoes-and-spinach-567458\">Cheese Tortellini with Sausage, Tomatoes and Spinach</a>, <a href=\"https://spoonacular.com/recipes/30-minute-cheese-tortellini-with-sausage-in-a-creamy-broth-514025\">30-minute Cheese Tortellini with Sausage in a Creamy Broth</a>, and <a href=\"https://spoonacular.com/recipes/crock-pot-sausage-and-cheese-tortellini-soup-484445\">Crock-Pot Sausage and Cheese Tortellini Soup</a>."
    },
    {
        "id": 654568,
        "title": "Panned Veal Chop",
        "readyInMinutes": 45,
        "servings": 4,
        "image": "https://spoonacular.com/recipeImages/654568-312x150.jpg",
        "imageUrls": [
            "Panned-Veal-Chop-654568.jpg"
        ],
        "description": "You can never have too many main course recipes, so give Panned Veal Chop a try. This recipe makes 4 servings with <b>813 calories</b>, <b>57g of protein</b>, and <b>37g of fat</b> each. For <b>$2.89 per serving</b>, this recipe <b>covers 36%</b> of your daily requirements of vitamins and minerals. A mixture of bread crumbs, butter, olive oil, and a handful of other ingredients are all it takes to make this recipe so yummy. It is brought to you by Foodista. Not a lot of people made this recipe, and 1 would say it hit the spot. From preparation to the plate, this recipe takes around <b>45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 73%</b>, which is solid. Similar recipes include <a href=\"https://spoonacular.com/recipes/veal-chop-holstein-schnitzel-299397\">Veal Chop Holstein Schnitzel</a>, <a href=\"https://spoonacular.com/recipes/roasted-veal-chop-with-morels-115934\">Roasted Veal Chop with Morels</a>, and <a href=\"https://spoonacular.com/recipes/double-cut-veal-chop-saltimboca-311286\">Double Cut Veal Chop Saltimboca</a>."
    }
]